Revit 2024 API
VertexFormat.Dispose Method
Releases all resources used by the VertexFormat
Namespace: Autodesk.Revit.DB.DirectContext3D
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public void Dispose()
Visual Basic
Public Sub Dispose
Visual C++
public:
virtual void Dispose() sealed
Implements
IDisposable.Dispose()
See Also
VertexFormat Class
Autodesk.Revit.DB.DirectContext3D Namespace